app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT `projects`.* FROM `projects`

    def set_project
      @project = Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1